[
  {
    "name": "In which country do you currently work?",
    "value": ["United States of America - New York"]
  },
  {
    "name": "How did you perform in your native language at high school?",
    "value": ["Top 10% at school"]
  },
  {
    "name": "Describe your engineering experience with Python and/or Golang",
    "value": "I have extensive experience in Python, having led teams in developing backend processes for applications, including integrating CI/CD best practices and optimizing system performance for real-time data processing. My role as a Product Manager involved overseeing the design and implementation of Python-driven systems, ensuring code quality and maintainability through rigorous code reviews."
  },
  {
    "name": "In the past ten years, looking only at the time since you graduated your first undergraduate degree, how many companies have you worked for?",
    "value": ["3"]
  },
  {
    "name": "How did you perform in mathematics at high school?",
    "value": ["Top 10% at school"]
  },
  {
    "name": "Describe your software engineering leadership experience.",
    "value": "As a Product Manager at Cider and Alibaba Group, I led cross-functional teams in designing and developing software products, focusing on integrating best practices in CI/CD and ensuring code quality through regular code reviews. My experience includes overseeing technical design reviews and fostering collaboration between product and engineering teams to enhance user experience."
  },
  {
    "name": "What was your bachelor's university degree result, or expected result if you have not yet graduated? Please include the grading system to help us understand your result e.g. ‘85 out of 100’, ‘2:1 (Grading system: first class, 2:1, 2:2, third class)’ or ‘GPA score of 3.8/4.0 (predicted)’. We have hired outstanding individuals who did not attend or complete university. If this describes you, please continue with your application and enter ‘no degree’.",
    "value": "GPA score of 3.86/4.0 (Stanford University)"
  },
  {
    "name": "During this application process I agree to use only my own words. I understand that plagiarism, the use of AI or other generated content will disqualify my application.",
    "value": ["Yes"]
  },
  {
    "name": "Describe your experience with workflow engines and CI/CD",
    "value": "I have coordinated the analysis, design, and delivery of product features with a focus on integrating CI/CD best practices to maintain system efficiency. My experience includes leading code reviews and ensuring code quality, as well as testing and maintaining deployed software to optimize performance."
  },
  {
    "name": "We require all colleagues to meet in person 2-4 times a year, at internal company events lasting between 1-2 weeks. We try to pick new and interesting locations that will likely require international travel and entry requirement visas and vaccinations. Are you willing and able to commit to this?",
    "value": ["No"]
  },
  {
    "name": "Please confirm that you have read and agree to Canonical's Recruitment Privacy Notice and Privacy Policy.",
    "value": ["Acknowledge/Confirm"]
  },
  {
    "name": "Website",
    "value": "Other"
  },
  {
    "name": "Please share your rationale or evidence for the high school performance selections above. Make reference to  provincial, state or nation-wide scoring systems, rankings, or recognition awards, or to competitive or selective college entrance results such as SAT or ACT scores, JAMB, matriculation results, IB results etc. We recognise every system is different but we will ask you to justify your selections above.",
    "value": "I graduated high school with a strong academic record, consistently achieving high grades across all subjects. I participated in various competitive exams and was recognized for my performance in state-level mathematics competitions. My SAT scores were above the national average, reflecting my readiness for college-level coursework."
  },
  {
    "name": "Describe your experience with AWS, Azure and GCP, using VM level operations, and at what scale",
    "value": "I have hands-on experience with AWS, Azure, and GCP, primarily focusing on VM-level operations. At Cider, I managed cloud infrastructure for product deployments, utilizing AWS EC2 instances to scale applications based on user demand. I have worked with Azure for data analytics projects, deploying VMs to process large datasets, and have utilized GCP for machine learning model training, handling workloads that scaled to hundreds of instances during peak processing times."
  },
  {
    "name": "First Name",
    "value": "Daniel"
  },
  {
    "name": "Last Name",
    "value": "Wang"
  },
  {
    "name": "Email",
    "value": "badwzc@qq.com"
  },
  {
    "name": "Phone",
    "value": "4255550100"
  },
  {
    "name": "LinkedIn Profile",
    "value": "https://www.linkedin.com/in/sean-dickson-91408/"
  },
  {
    "name": "Which gender do you identify as?",
    "value": ["Male"]
  },
  {
    "Education": [
      {
        "Degree": "Master's Degree",
        "Discipline": ["Communications & Film"],
        "School": "San Jose State University",
        "Start": "2014-01-01",
        "End": "2015-01-01",
        "isCurrent": false
      },
      {
        "Degree": "Bachelor's Degree",
        "Discipline": ["Chemistry"],
        "School": "Purdue University - Calumet",
        "Start": "2024-02-16",
        "End": "2025-02-16",
        "isCurrent": false,
        "gpa": "4.5/5.0"
      }
    ]
  }
]
